/**
 * Created by Sherlock on 2018/7/5.
 */

/*姓名(中文)、地址(中文)、手机号、固定电话、邮箱、身份证号、
 密码、网址、日期、时间、邮政编号 */

layui.use(["form"],function(){
   var form=layui.form;

    //设置表单验证
    form.verify({
         /*username:function (value,item){ //value：表单的值、item：表单的DOM对象
             if (!/^[a-zA-Z0-9_\u4e00-\u9fa5\\s·]+$"/.test(value)) {
                    return '用户名不能有特殊字符';
             }
             if (/(^\_)|(\__)|(\_+$)/.test(value)){
                return '用户名首尾不能出现下划线\'_\'';
             }
             if (/^\d+\d+\d$/.test(value)) {
                return '用户名不能全为数字';
             }
         },*/
         username1:[        //用户名
             /^[\u4E00-\u9FA5A-Za-z0-9]{4,}$/,
             '请输入正确的名字(中文、大小写英文字母、4字以上)'
         ],
         custom_name:[

         ],
         custom_tel:[
            //固定电话
            /*/^(\(\d{3,4}-)|\d{3.4}-)?\d{7,8}$/,*/
             /^(((0\d2|0\d{2})[- ]?)?\d{8}|((0\d3|0\d{3})[- ]?)?\d{7})(-\d{3})?$/,
            '请输入正确的固定号(XXX-XXXXXXX)'
        ],
         custom_phone:[     //手机号
             /^(13[0-9]|14[579]|15[0-3,5-9]|16[6]|17[0135678]|18[0-9])\d{8}$/,
             "请输入正确的手机号"
         ],
         custom_wx:[        //微信号
             /^[a-zA-Z0-9_-]{5,19}$/,
             "请输入正确的微信号"
         ],
         custom_qqNumber:[   //qq号
            /[1-9][0-9]{4,}/,
            '请输入正确的QQ号'
        ],
         custom_number:[     //正整数
             /^[1-9]\d{1,}$/,
             "请输入正整数"
         ],
         custom_email:[     //邮箱
             ////邮箱名以数字或字母开头；邮箱名可由字母、数字、点号、减号、下划线组成；
             // 邮箱名（@前的字符）长度为3～18个字符；邮箱名不能以点号、减号或下划线结尾；不能出现连续两个或两个以上的点号、减号。
             /*/^([\w-\.]+)@([\w-\.]+)(\.[a-zA-Z0-9]+)$/,*/

             //
             /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
             "请输入正确的邮箱名称"
         ],
        custom_password:[
            //密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)：
            /^[a-zA-Z]\w{6,18}$/,
            "密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)"
        ],
        custom_strongPassword:[
            //强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间)：
            /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$/,
            '密码必须包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间'
        ],
        custom_date:[
            //日期格式
            /^\d{4}-\d{1,2}-\d{1,2}/,
            '日期格式为YYYY-MM-DD'
        ]

    });

});
